{
  "why-me": {
    "title": "Why me",
    "locationText": "First text for typing effect",
    "whyMeText": "I've always been fascinated by technology – from networks to software solutions. Coding provides the ideal challenge: analyzing problems with focus, developing user-friendly solutions, and always keeping an eye on what really matters.",
    "talkButtonAlt": "Talk to me button"
  },

  "header": {
    "logoAlt": "Logo",
    "navLinks": {
      "whyme": "Why me",
      "skills": "Skills",
      "projects": "Projects",
      "contact": "Contact"
    }
  },

  "skills": {
    "title": "My Skills"
  },

  "inputBox": {
    "subject": "I am currently learning",
    "inputText": "Show that you are motivated to continually improve your skills, implement innovative solutions and stay abreast of new technologies."
  },

  "contact": {
    "headline": "Let us work togehter!",
    "title": "Contact me",
    "text": "If you’re looking for a motivated frontend developer eager to learn and contribute to your projects, feel free to reach out! I’m excited about job opportunities, freelance work, or interesting collaborations.",

    "required": {
      "email": "Your email is required.",
      "name": "Your name is required.",
      "message": "Your message is required.",
      "privacyText": "Please accept the privacy policy."
    },

    "formFields": {
      "name": {
        "label": "Your name"
      },
      "email": {
        "label": "Your Email"
      },
      "message": {
        "label": "Your message",
        "privacyText": " I've read the ",
        "privacyText2": "and agree to the processing of my data as outlined.",
        "privacyPolicyText": "privacy policy"
      }
    },
    "descriptionText": "Feel free to get in touch with job offers or opportunities such as: ... Show that you will add value to their projects through your work."
  },

  "feedback": {
    "titel": "Need a teamplayer? Here what my colleagues said about me",
    "linkText": "Linked in Profile",
    "mobileTitel": "Need a teamplayer?",
    "mobileTitel2": "Here what my colleagues said about me",

    "feedback1": {
      "userName": "Pascal Fliedner",
      "project": "Project ",
      "projectName": "Join",
      "text": "‘’Burak brings structure and clarity to every project. With his analytical mindset and solution-oriented approach, he has greatly supported the team. Working with him is always professional and inspiring.‘’",
      "link": "sius naros"
    },

    "feedback2": {
      "userName": "Maik Bennefeld",
      "projectName": "Join",
      "text": "‘’He impresses with his creativity and technical expertise. He contributes fresh ideas and reliably translates them into clean code. With his positive attitude, he makes every teamwork efficient and enjoyable.‘’",
      "link": "sius naros"
    },

    "feedback3": {
      "userName": "Irina Gorges",
      "projectName": "Join",
      "text": "‘’He is highly committed and approaches complex topics with great interest. His helpfulness and team spirit create an excellent working atmosphere. Through his clear communication and reliability, he has made a decisive contribution to the project.‘’",
      "link": "sius naros"
    }
  },

  "currentLearning": {
    "templateText": "I am currently learning",
    "inputText": "I’m highly motivated to continuously improve my skills, implement innovative solutions, and stay up to date with the latest technologies to create modern and efficient web applications."
  },

  "PROJECTS": {
    "TITLE": "My Projects",
    "EL_POLO_LOCO": {
      "TITLE": "El Pollo Loco",
      "DURATION": "Duration: 4 weeks",
      "DESCRIPTION": "Jump-and-run game inspired by classic platformers.",
      "BULLET_POINTS": {
        "ABOUT_TITLE": "About the project",
        "ABOUT_CONTENT": "A simple Jump-and-Run game based on an object-oriented approach. Help Pepe to find coins and bottles to fight against the Chicken.",
        "WORK_PROCESS_TITLE": "How I have organised my work process",
        "WORK_PROCESS_CONTENT": "For “El Pollo Loco,” I organized my workflow by breaking down game features into distinct phases such as level design, controls, and enemy behavior. This approach helped me work systematically, prioritize tasks, and maintain a clear overview.",
        "LEARNINGS_TITLE": "My work experience",
        "LEARNINGS_CONTENT": "I especially enjoyed this project because it gave me the opportunity to dive deep into object-oriented programming with JavaScript and to strengthen my understanding of game logic and game loops."
      },
      "URL": "Play Game"
    },

    "JOIN": {
      "TITLE": "Join",
      "DURATION": "Duration: 3 weeks",
      "DESCRIPTION": "Task manager inspired by the Kanban System.",
      "BULLET_POINTS": {
        "ABOUT_TITLE": "About the project",
        "ABOUT_CONTENT": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
        "WORK_PROCESS_TITLE": "How I have organised my work process",
        "WORK_PROCESS_CONTENT": "I organized the project with a clear module structure, meaningful naming, and thorough documentation. This keeps the code clean and maintainable, which is especially important when implementing complex game logic.",
        "LEARNINGS_TITLE": "My group work experience",
        "LEARNINGS_CONTENT": "We were a team of four, and the collaboration was excellent. My main responsibility was implementing the core logic of the app, working closely with the others throughout the process."
      },
      "URL": "Try it now"
    },

    "ONGOING_PROJECT": {
      "TITLE": "Ongoing Project",
      "DESCRIPTION": "Live F1 betting app using virtual coins and private friend pools.",
      "BULLET_POINTS": {
        "ABOUT_TITLE": "Overtake™ – Formula 1 Standings & Live Data",
        "ABOUT_CONTENT": "An Angular app for displaying driver and constructor standings with fullcards for detailed driver information. Planned features include a race calendar, sessions, and live data.",
        "WORK_PROCESS_TITLE": "How I have organised my work process",
        "WORK_PROCESS_CONTENT": "Focus on clean architecture with Angular 19, RxJS, and manually maintained SCSS. I am deepening my knowledge of API integration, Firestore usage, and responsive design to deliver a high-performance portfolio project.",
        "LEARNINGS_TITLE": "My work experience",
        "LEARNINGS_CONTENT": "As part of this project, I am gaining practical experience in development with Angular 19. I work extensively with RxJS streams, Observables, and Firebase to handle data efficiently. At the same time, I am strengthening my skills in responsive design, animations, and building a well-structured frontend architecture."
      },
      "URL": "Try it now"
    }
  },

  "IMPRINT": {
    "TITLE": "Legal Notice",
    "LEGAL_DISCLAIMER": "Information according to § 5 TMG (Germany)",
    "ADDRESS": {
      "NAME": "Burak Bostanli",
      "COMPANY": "coupstudios",
      "STREET": "Untere Marktstraße 12a",
      "CITY_ZIP": "85080 Gaimersheim, Germany"
    },
    "CONTACT": {
      "EMAIL": "Email: info@coup-studios.com"
    },
    "VAT": {
      "ID": "VAT ID according to § 27 a German VAT Act: DE357705274"
    },
    "DISPUTE_RESOLUTION": {
      "EU_LINK": "EU Commission's Online Dispute Resolution Platform: https://ec.europa.eu/consumers/odr",
      "NOTE": "We are neither obliged nor willing to participate in dispute resolution proceedings before a consumer arbitration board."
    }
  },

  "PRIVACY": {
    "TITLE": "Privacy Policy",
    "INTRO": "Controller under data protection laws:",
    "DATA_COLLECTION": {
      "TITLE": "Data we collect",
      "ITEMS": [
        "Contact form data (name, email, message)",
        "Usage data (IP, browser, access times)",
        "Cookies (session cookies)"
      ]
    },
    "PURPOSE": {
      "TITLE": "Purpose of processing",
      "CONTENT": "Data is processed solely for contact requests and website functionality."
    },
    "STORAGE": {
      "TITLE": "Storage duration",
      "CONTENT": "Data is stored for maximum 12 months unless legally required."
    },
    "RIGHTS": {
      "TITLE": "Your rights",
      "ITEMS": [
        "Access to stored data",
        "Rectification or deletion",
        "Objection to processing"
      ]
    },
    "CONTACT": {
      "TITLE": "Contact our Data Protection Officer",
      "EMAIL": "Email: privacy@coup-studios.com"
    }
  },
  "contactConfirmation": {
    "confirmationMessage": "Your message was sent successfully",
    "confirmationClose": "close"
  },
  "LOCATION": "I am located in Ingolstadt...|",
  "REMOTE_WORK": "I am open to work remote...|",
  "RELOCATION": "I am open to relocate...|"
}
